export default function AboutPage() {
  return (
    <div className="max-w-3xl mx-auto p-6 space-y-6">
      <h1 className="text-3xl font-bold mb-4">Про проєкт</h1>
      <p className="text-lg leading-relaxed">
        Цей проєкт є дипломною роботою Яценка Ігоря, студента групи ПЗ-21-2 
        Дніпровського національного університету імені Олеся Гончара
      </p>
      <p className="text-gray-600 mt-4">
        Проєкт демонструє здобуті навички у розробці клієнтських та серверних частин вебзастосунку, інтеграції з базою даних і хмарними сервісами.
        Реалізовано сучасний інтерфейс, безпечну авторизацію, роботу з медіа через Cloudinary, а також оптимізовану взаємодію з базою даних за допомогою Prisma.
      </p>
      <p className="mt-8 text-center text-sm text-gray-400">
        © 2025 Дипломний проєкт. Усі права захищені.
      </p>
    </div>
  )
}